In [50]:
import sqlite3
conn=sqlite3.connect('schools_database.db')
cur=conn.cursor()

In [51]:
# create table only if it does not already exist; fix INTEGER typos
cur.execute('''CREATE TABLE IF NOT EXISTS schools(
                id INTEGER PRIMARY KEY,
                name TEXT,
                age INTEGER,
                email TEXT)
            ''')

In [52]:
cur.execute('''INSERT INTO schools(name, age, email)
               VALUES('Alice', 14, 'alice@gmail.com')''')

OperationalError: database is locked

In [ ]:
query= '''SELECT * FROM schools;'''
result=cur.execute(query).fetchall()
print(result)

[(1, 'Alice', 14, 'alice@gmail.com')]

### CRUD OPERATIONS: CREATE ,UPDATE,INSERT,DELETE,ALTER

In [ ]:
cur.execute('''ALTER TABLE schools ADD COLUMN school_name TEXT''')

In [ ]:
cur.execute('''UPDATE schools SET school_name= 'ABC high school' WHERE name='Alice';''')

In [ ]:
query= '''SELECT * FROM schools;'''
result=cur.execute(query).fetchall()
print(result)

[(1, 'Alice', 14, 'alice@gmail.com', 'ABC high school')]

In [ ]:
cur.execute('''ALTER TABLE schools ADD COLUMN grade INTERGER''')

In [ ]:
cur.execute('''UPDATE schools SET grade= 9 WHERE name='Alice';''')

In [ ]:
query= '''SELECT * FROM schools;'''
result=cur.execute(query).fetchall()
print(result)

[(1, 'Alice', 14, 'alice@gmail.com', 'ABC high school', 9)]

In [ ]:
cur.execute('''INSERT INTO schools(name, age, email,school_name,grade)
               VALUES('Marley', 6, 'marley@gmail.com','sacho High',2);''')

In [ ]:
cur.execute('''INSERT INTO schools(name, age, email,school_name,grade)
               VALUES('Bob', 16, 'bob@gmail.com','123 High',9),('Eve',12,'eve@moringa.com','KBT high',8);''')

In [ ]:
query= '''SELECT * FROM schools;'''
result=cur.execute(query).fetchall()
print(result)

[(1, 'Alice', 14, 'alice@gmail.com', 'ABC high school', 9), (2, 'Marley', 6, 'marley@gmail.com', 'sacho High', 2), (3, 'Bob', 16, 'bob@gmail.com', '123 High', 9), (4, 'Eve', 12, 'eve@moringa.com', 'KBT high', 8)]

In [ ]:
cur.execute('''DELETE FROM schools WHERE id=4;''')

OperationalError: database is locked

In [ ]:
query= '''SELECT * FROM schools;'''
result=cur.execute(query).fetchall()
print(result)

[(1, 'Alice', 14, 'alice@gmail.com', 'ABC high school', 9), (2, 'Marley', 6, 'marley@gmail.com', 'sacho High', 2), (3, 'Bob', 16, 'bob@gmail.com', '123 High', 9), (4, 'Eve', 12, 'eve@moringa.com', 'KBT high', 8)]

In [ ]:
conn.close()